module binbcd14 (
    input[13:0] b, //最高14'b11_1111_1111_1111=16383，9999=14'b10_0111_0000_1111
    output reg[16:0] p //16383对应BCD码有17位，9999对应BCD码为16'b1001_1001_1001_1001 
);
    //大4加3法，原理没懂
    reg[32:0] z; //不懂为啥33位
    integer i;

    always@(*) begin
        for(i=0;i<=32;i=i+1) z[i]=0;    
        z[16:3]=b; //直接把b左移3位了
        repeat(11) //一共14次，前面已经移动了3次
        begin
            if(z[17:14]>4) //如果个位大于4
                z[17:14]=z[17:14]+3;
            else;
            if(z[21:18]>4) //如果十位大于4
                z[21:18]=z[21:18]+3;
            else;
            if(z[25:22]>4) //如果百位大于4
                z[25:22]=z[25:22]+3;
            else;
            if(z[29:26]>4) //如果千位大于4
                z[29:26]=z[29:26]+3;
            else;
            z[32:1]=z[31:0]; //左移一位
        end
        p=z[30:14]; //最高2位没用
    end
    
endmodule